sdaiCreateInstanceBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Creates an application instance within an associated model.
\param model      [in] A model.
\param entityName [in] A name of the entity to be created.
\returns A created application instance represented with its pointer if it was created successfully; otherwise, the function returns a NULL pointer.
\code
SdaiModel model = ...;
SdaiAppInstance cartesianPoint = sdaiCreateInstanceBN(model, "IfcCartesianPoint");
\remarks
The function is case insensitive.
The model should be accessed with the sdaiRW mode.